Repository: 84000/data-translation-memory
Catalog: toh136-v3.tmx
Source language: bo
Languages: en

source: པད་མ་རེ་རེའི་སྙིང་པོ་ལ་ཡང་སེང་གེའི་ཁྲི་བྱེ་བ་ཕྲག་འབུམ་འབུམ་མངོན་པར་སྤྲུལ་ཏོ། །སེང་གེའི་ཁྲི་རེ་རེ་ལ་ཡང་དེ་བཞིན་གཤེགས་པ་རེ་རེ་མངོན་པར་སྤྲུལ་ཏེ་སངས་རྒྱས་ཀྱི་སྐུས་ཆོས་སྟོན་ཅིང་བཞུགས་པར་གྱུར་ཏོ། །དེ་བཞིན་གཤེགས་པ་དེ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་དང་།
en: At the center of each lotus appeared billions upon billions of lion thrones, and upon each lion throne sat a thus-gone one, teaching the Dharma in the form of a buddha.

source: གཟུངས་དང་། རྡོ་རྗེའི་ཚིག་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་དང་། འཁོར་གསུམ་ཡོངས་སུ་དག་པ་དང་། སངས་རྒྱས་ཀྱི་སྟོབས་དང་། མི་འཇིགས་པ་དག་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་མ་གཏོགས་པར་གཏམ་གཞན་མི་གསུང་ངོ་། །
en: The thus-gone ones did not speak other than to thoroughly teach the Dharma discourses of the Bodhisattva Collection, dhāraṇīs, vajrapadas, the purity of the three spheres, and the powers and fearlessnesses of a buddha.

source: དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་རེ་རེས་ཆོས་བསྟན་པ་དེས་ཀྱང་སེམས་ཅན་དག་པ་དག་ལས་སྲོག་ཆགས་བྱེ་བ་འབུམ་ཕྲག་དུ་མ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ལ་རབ་ཏུ་བཀོད་དོ། །
en: And each of those emanated thus-gone ones, by teaching the Dharma, firmly established many billions of beings who had purified themselves at the level of irreversibility on the path to unsurpassed, completely perfect awakening.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གྱད་རྣམས་དང་ཉེ་བ་ན་ཡོད་པ་ཤིང་སཱ་ལ་ཟུང་གི་བར་དུ་དེ་བཞིན་གཤེགས་པའི་སྐུ་གློ་གཡས་པས་སེང་གེའི་གཟིམས་ཁྲི་ལ་གཟིམས་པ་ཞིག་མངོན་པར་སྤྲུལ་པ་མཛད་ནས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ཡང་སོས་ཀྱི་གནས་སུ་གཤེགས་ཏེ་རང་རང་གི་སྐུ་ལས་འོད་རབ་ཏུ་བཀྱེའོ། །
en: Then the Blessed One, while magically displaying himself lying down on the Thus-Gone One’s right side upon a lion couch, between a pair of śāla trees in the country of the Mallas, went to where beings were dwelling in the Great Reviving Hell and radiated light from each of his bodies.

source: དེ་རབ་ཏུ་བཀྱེ་མ་ཐག་ཏུ་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ཡང་སོས་ཀྱི་གནས་ཐམས་ཅད་སྣང་བར་གྱུར་ཏོ། །
en: As soon as he emitted this light, all those hell beings dwelling in the Great Reviving Hell were illuminated.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འོད་ཀྱིས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ཡང་སོས་ཀྱི་གནས་ཐམས་ཅད་སྣང་བར་མཛད་ནས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །སེམས་ཅན་འདི་དག་ཡང་དང་ཡང་། །བསད་ཅིང་བསད་ཅིང་ཕྱིར་ཡང་འཚོ། །འདུ་ཤེས་དེ་ཉིད་བསྟན་བྱེད་པས། །
en: Then the Blessed One, while illuminating the hell beings dwelling in the Great Reviving Hell with this light, spoke these verses: “Beings here are killed and revived Over and over again.

source: དེས་ན་སྡུག་བསྔལ་འབྱུང་བར་འགྱུར། །
en: With this as their most basic experience, They suffer tremendous agonies.

source: འཇིག་རྟེན་མགོན་པོ་འོད་མཛད་པ། །འཇིག་རྟེན་འདིར་ནི་བྱུང་གྱུར་ནས། །
en: “When the world protector, the maker of light, Appeared in this world, He taught the sublime Dharma That is uncorrupted and unceasing.

source: གང་གིས་སྡུག་བསྔལ་འགག་འགྱུར་བ། །ཟད་པ་མེད་ཅིང་ལེན་མེད་ལ། །འགག་པ་མེད་ཅིང་ཟག་མེད་པའི། །
en: “It brings an end to suffering, Is inexhaustible and beyond grasping, And, when fully understood, Ensures an end to all bad rebirth.”

source: དམ་པའི་ཆོས་ནི་སྟོན་པར་མཛད། །གང་དག་ཆོས་འདི་རབ་ཤེས་པ། །དེ་དག་ངན་འགྲོར་འགྲོ་མི་འགྱུར། །བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་དེ་དག་བཀའ་སྩལ་མ་ཐག་ཏུ་དེ་ནས་སྐད་ཅིག་དེ་དང་ཐང་ཅིག་དེ་དང་། ཡུད་ཙམ་དེ་ལ་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ཡང་སོས་ཀྱི་གནས་ནས་སྲོག་ཆགས་དུང་ཕྱུར་ཕྲག་གསུམ་གྱིས་ཆོས་འདི་ཐོས་ནས་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ཐོབ་པར་གྱུར་ཏེ།
en: As soon as the Blessed One had spoken these verses, right then, at that very instant, on hearing these words, three hundred million beings living in the Great Reviving Hell achieved the level of nonreturning.

source: ཆོས་ཐོབ་པ་དེ་དག་གིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །ཟད་པ་མ་མཆིས་ལེན་མ་མཆིས། །མི་འགག་ཟག་པ་མ་མཆིས་པའི། །འཕགས་པའི་ཆོས་འདི་འཚལ་གྱུར་པས། །བདག་ཅག་བསིལ་གྱུར་མྱ་ངན་འདས། །
en: Then those who had received the teaching spoke these verses: “We have discovered the noble Dharma, Inexhaustible, free from grasping, Unceasing, and uncorrupted; Now we are soothed, our pain transcended.

source: མཁྱེན་ནས་ཇི་བཞིན་ཉིད་བརྙེས་ཤིང་། །
en: “With understanding, he discovered the way things are.

source: སེམས་ཅན་རྣམས་ཀྱི་དབང་པོ་མཁྱེན། །རྒྱུ་དང་རྐྱེན་རྣམས་སྟོན་མཛད་ཅིང་། །
en: Knowing beings’ abilities, He teaches causes and conditions.

source: སེམས་ཅན་རྣམས་ལ་ཐུགས་བརྩེ་བ། །
en: He has a deep love for beings.

source: ཟུག་རྔུ་འབྱིན་ཅིང་གསོས་མཛད་ལ། །
en: “The omniscient one removes our pain.

source: སྨན་སྩོལ་མཛད་ཅིང་ཐམས་ཅད་མཁྱེན། །
en: He nourishes us, he gives us the cure.

source: མྱ་ངན་འདའ་བ་སྟོན་མཛད་པའི། །རྫོགས་སངས་རྒྱས་ཀྱིས་བདག་ཅག་བཏུལ། །
en: The perfect Buddha has tamed us. He has shown us how to transcend suffering.

source: མིག་དང་སྒྲོན་མར་གྱུར་པ་འདི། །ཤིན་ཏུ་མྱུར་བར་འདས་གྱུར་ན། །
en: “Our eyes, our lamp, Will very soon pass away.

source: སུ་ཞིག་སྲོག་ཆགས་བྱེ་བ་རྣམས། །ཡང་སོས་གནོད་ལས་ཐར་མཛད་འགྱུར། །
en: Who then will liberate millions of beings From the torment of being continuously revived?

source: ཟུག་རྔུ་འབྱིན་མཛད་སྨན་པ་ཆེ། །འབྱུང་པོ་ཀུན་གྱི་གསོས་མཛད་པ། །དེ་ཡིས་སེམས་ཅན་གང་གསོས་པ། །དེ་དག་ངན་འགྲོར་མཆི་མི་འགྱུར། །
en: “He is the great physician who removes all pain, The sustainer of all that lives, Who nourishes beings And ensures an end to bad rebirth.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེའི་ཚེ་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ཐིག་ནག་གི་གནས་ཀྱི་མཐར་བཞུགས་ཏེ་འོད་རྒྱ་ཆེན་པོ་རབ་ཏུ་བཀྱེའོ། །དེས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོའི་གནས་དེ་སྣང་བར་གྱུར་ནས་སྲོག་ཆགས་སྟོང་ཕྲག་མང་པོ་དག་དེ་ནས་བཏོན་ཏེ་མཐོ་རིས་ལ་རབ་ཏུ་བཀོད་དོ། །
en: The Blessed One then took a place at the edge of the Great Black Line Hell and radiated a great light that lit up the beings living there, releasing many thousands and sending them to the higher realms.

source: དེ་བཞིན་དུ་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་བསྡུས་གཞོམ་དང་། ངུ་འབོད་དང་ངུ་འབོད་ཆེན་པོ་དང་། ཚ་བ་དང་། རབ་ཏུ་ཚ་བ་དག་ནས་ཀྱང་སྲོག་ཆགས་སྟོང་ཕྲག་མང་པོ་དག་བཏོན་ཏེ་མཐོ་རིས་དང་མྱ་ངན་ལས་འདའ་བའི་ལམ་ལ་རབ་ཏུ་བཀོད་དོ། །
en: In the same way, he released many thousands of beings from the Great Crushing Hell, the Wailing Hell, the Great Wailing Hell, the Hell of Heat, and the Hell of Intense Heat.

source: དེ་ནས་སྐད་ཅིག་དེ་དང་ཐང་ཅིག་དེ་དང་།
en: He sent them to the higher realms and established them on the path that transcends suffering.

source: ཡུད་ཙམ་དེ་ལ་སྲོག་ཆགས་བྱེ་བ་འབུམ་ཕྲག་དུ་མ་དག་སེམས་ཅན་དམྱལ་བའི་གནས་དག་ནས་ཤི་འཕོས་ནས་དགའ་ལྡན་གྱི་ལྷའི་རིས་སུ་སྐྱེས་སོ། །སྐྱེས་མ་ཐག་ཏུ་ལྷའི་བུ་དེ་དག་གིས་སྔོན་གྱི་ཆོས་ཡང་དག་པར་རྗེས་སུ་དྲན་ནས་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ཐོབ་བོ། །དེ་ནས་ལྷའི་བུ་ཆོས་ཐོབ་པ། ཆོས་རྟོགས་པ། ཆོས་ཀྱི་གཏིང་དུ་ཞུགས་པ་དེ་དག་གིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །ཇི་ལྟར་དགོན་པའི་ཤུལ་ཞིག་ཏུ། །
en: At that moment, right then, at that very instant, many billions of beings living in the hell realms died and were reborn among the gods in the Heaven of Joy, and as soon as they were born there, those gods could perfectly recall the teachings they had previously received and attained the level of nonreturning.

source: དེད་དཔོན་འཇིགས་པ་མ་མཆིས་པས། །ཆོམ་རྐུན་གདུག་པས་གཙེས་གྱུར་པའི། །སེམས་ཅན་མང་པོ་ཐར་བགྱིད་ལྟར། །དེ་བཞིན་འཁོར་བའི་བཙོན་ར་ལས། །དེད་དཔོན་བླ་ན་མ་མཆིས་པ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱིས་ནི། །
en: Then, when those gods who had received the teachings had understood them and deeply inculcated them, they spoke these verses: “Just as when traveling through a remote and empty place A fearless caravan leader Can keep many beings Free from the danger of bandits, “So does the unsurpassable caravan leader, The blessed Buddha, Free millions of beings From the prison of cyclic existence.

source: སེམས་ཅན་བྱེ་བ་ཐར་བར་མཛད། །ཐུགས་རྗེ་ཉེ་བར་བསྐྱེད་མཛད་ཅིང་། །བདག་ཅག་སྡུག་བསྔལ་ཐར་མཛད་པའི། །
en: “Awakening great compassion, He has freed us from our suffering.

source: བླ་མེད་དེད་དཔོན་འོད་མཛད་པ། །སངས་རྒྱས་ལ་ནི་སྐྱབས་སུ་མཆི། །
en: Unsurpassable caravan leader, maker of light, Awakened One, we take refuge in you!

source: བདག་ཅག་ལུས་ཀྱིས་རེག་གྱུར་པའི། །ཆོས་དང་ཡོན་ཏན་བསམ་ཡས་པའི། །ཚོགས་མཆོག་འཕགས་པའི་དགེ་འདུན་ལའང་། །བདག་ཅག་སྐྱབས་སུ་ཉེ་བར་མཆི། །
en: “We also take refuge In the Dharma, which has touched us deeply, And in the noble Saṅgha, the supreme assembly Inconceivably rich in good qualities.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འོད་བསིལ་ཞིང་འཇམ་པས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་མནར་མེད་པའི་གནས་ཀྱི་སེམས་ཅན་དམྱལ་བའི་ཡོངས་སུ་གདུང་བ་སིམ་ཞིང་བསིལ་བར་མཛད་ནས་ཡན་ལག་སྟོང་ཡོངས་སུ་རྫོགས་པ། སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་སིམ་པ་སྐྱེད་པ།
en: The Blessed One then sent forth rays of soft, cooling light to comfort and soothe the intense torments of those inhabiting the Great Hell of Unceasing Torture.

source: འཇམ་པ་སྙན་པར་གསུང་པ། ཕན་པ་དང་བདེ་བར་མཛད་པ། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་ལྡན་པའི་གསུང་གིས་སེམས་ཅན་དམྱལ་བ་པ་དེ་དག་ལ་བཀའ་སྩོལ་ཅིང་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །
en: He taught those hell beings about emptiness, signlessness, and wishlessness, with a teaching that was perfect in its thousand aspects and that gladdened the hearts of all, was pleasing to the ear, and brought welfare and happiness.

source: གང་གིས་སྟོང་ཉིད་མཚན་མེད་དང་། །སྐྱེ་མེད་འདུས་བྱས་མ་ཡིན་པའི། །ཆོས་རྣམས་རབ་ཏུ་ཤེས་གྱུར་པ། །དེ་དག་ངན་འགྲོའི་འཇིགས་ལས་འགྲོལ། །
en: He then uttered this verse: “Those who have fully understood That phenomena are empty, signless, Unborn, and unconstructed Are free from fears of the lower realms.”

source: དེ་ནས་སྲོག་ཆགས་བྱེ་བ་འབུམ་ཕྲག་བརྒྱད་ཀྱིས་གསུང་དེ་ཐོས་ནས་དུས་གསུམ་ལ་ཐོགས་པ་མེད་ཅིང་ཡན་ལག་གི་ཡོན་ཏན་འབུམ་དང་ལྡན་པའི་སྒྲ་རྣ་ལམ་དུ་གྲག་པ་ཐོས་ནས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་མནར་མེད་པའི་གནས་ནས་ཤི་འཕོས་ཏེ་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་དང་སྐལ་བ་མཉམ་པར་སྐྱེས་སོ། །
en: When those words, unimpeded in the three times and rich in a hundred thousand qualities, reached their ears, eight trillion beings in the Great Hell of Unceasing Torture died and were reborn equal in fortune to the gods in the Heaven of Mastery over Others’ Emanations.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཚངས་པའི་འཇིག་རྟེན་དུ་གཤེགས་ཏེ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །གང་ལ་སྡུག་བསྔལ་མི་རྙེད་པའི། །སེམས་ཅན་རྣམས་ནི་མཆོག་ཏུ་བདེ། །
en: The Blessed One then went to the Brahmā realms and spoke these verses: “Those who do not experience suffering Are supremely happy.

source: མིང་དང་མཚན་མ་ཐ་སྙད་དང་། །འདུ་ཤེས་གང་ཡིན་ཚུལ་བཞིན་མིན། །
en: All names, conventional designations, And conceptions are invalid.

source: བརྟན་པས་དེ་དག་རྣམ་སྤངས་ན། །དེས་ནི་སྡུག་བསྔལ་དག་ལས་དགྲོལ། །
en: “Those who can firmly abandon them Will be free from suffering.

source: གང་དག་གཟུགས་མེད་རྟེན་པ་ཡི། །འདུ་ཤེས་ཀུན་ཀྱང་ཚུལ་བཞིན་མིན། །
en: For them, even all conceptions Of the formless realm will be invalid.

source: ཡང་དང་ཡང་དུ་འཆི་འཕོ་ཞིང་། །ཤི་ནས་སྐྱེ་བར་འགྱུར་བ་ཡི། །སྡུག་བསྔལ་ཕྱིར་ཞིང་རབ་འཕེལ་བ། །ཁམས་གསུམ་པ་དག་ཅི་ཕྱིར་བདེ། །
en: “Suffering increases exponentially When one dies over and over again, Taking a new rebirth each time; What happiness is there in the three realms?

source: གང་གིས་སྟོང་པ་སྟོང་ཤེས་ཤིང་། །སྟོང་པ་དེ་ལའང་མི་སེམས་ལ། །
en: “Those who understand the empty to be empty Do not conceive of even the empty.

source: གང་དག་སྟོང་ཉིད་མི་མཐོང་བ། །དེ་དག་སྟོང་ཉིད་ཤེས་པ་ཡིན། །
en: Those who do not perceive emptiness Are those who know emptiness.

source: གང་གིས་ཆོས་དོན་དེ་ཤེས་པ། །དེ་ལ་བདག་ནི་རྙེད་མི་འགྱུར། །གང་ལ་བདག་ནི་མི་རྙེད་པ། །དེ་ལ་སྡུག་བསྔལ་ག་ལ་འབྱུང་། །
en: “Those who understand this point of doctrine Will not find a self, For there is no self to be found— So where can suffering arise?

source: སྟོང་དང་ཉེ་བར་ལེན་མེད་དང་། །མཚན་མ་རྙེད་པ་མ་ཡིན་ཞིང་། །བདག་མེད་ཆོས་ནི་སྟོན་བྱེད་པ། །སངས་རྒྱས་ཐུགས་ལས་སྐྱེས་པའི་སྲས། །
en: “Those who teach the selflessness of phenomena And that they are empty, free of grasping, And devoid of characteristics Are sons born from the hearts of the buddhas.”

source: དེ་ནས་གང་དག་དེར་སྐྱེས་པའི་སྲོག་ཆགས་བྱེ་བ་འབུམ་ཕྲག་བརྒྱད་པོ་དེ་དག་གིས་ཟག་པ་ཟད་པ་ཐོབ་ཅིང་ལྷའི་དྲང་སྲོང་དུ་གྱུར་ནས།
en: Then those eight trillion beings who had been reborn among those gods reached the exhaustion of defilements and became divine sages.

source: དེ་དག་གི་སེམས་ཅན་དམྱལ་བའི་གནས་དག་གི་སེམས་ཅན་དམྱལ་བའི་གནས་ཀྱི་སྡུག་བསྔལ་དག་རྗེས་སུ་དྲན་ཞིང་དེ་བཞིན་གཤེགས་པའི་སྐྱེས་བུའི་མཐུ་ཡང་རྗེས་སུ་དྲན་ནས་བྱས་པ་གཟོ་བའི་ཕྱིར་བདག་ཅག་གིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་མ་མཐོང་བར་དང་པོ་ཁོ་ནར་བདག་ཅག་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བྱའོ། །
en: Still recalling their suffering as hell beings in the hells, and in gratitude for the Thus-Gone One’s direct intervention, they exclaimed, “Rather than see the thus-gone, worthy, completely perfect Buddha pass into parinirvāṇa, we will pass completely beyond suffering first!”

source: ཞེས་དེ་ནས་ལྷའི་བུ་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་པ་དེ་དག་གིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །མི་འདུལ་ཁ་ལོ་སྒྱུར་བ་གང་ཟག་མཆོག །སྣང་བ་འོད་མཛད་རབ་ཏུ་གསལ་མཛད་པ། །མྱ་ངན་འདའ་བར་མཛད་པ་ཇི་ལྟར་བལྟ། །བདག་ཅག་སྔར་ཉིད་མྱ་ངན་འདའ་བར་བགྱི། །
en: Then, those gods who had reached the state of arhatship uttered this verse: “Tamer of beings, helmsman, best of humans, Maker of light, great illuminator, We will pass beyond, Just as we see you passing into nirvāṇa.”

source: དེ་སྐད་ཅེས་གསོལ་ནས་དེ་ཉིད་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །
en: And the moment they finished speaking, they passed completely beyond suffering.

source: དེ་ནས་བཅོམ་ལྡན་འདས་སྐད་ཅིག་དེ་དང་ཐང་ཅིག་དེ་དང་། ཡུད་ཙམ་དེ་ལ་ཚངས་པའི་འཇིག་རྟེན་ནས་མི་སྣང་བར་གྱུར་ཏེ། གྱད་རྣམས་དང་ཉེ་བ་ན་ཡོད་པ་ཤིང་སཱ་ལ་ཟུང་གི་བར་དུ་སླར་གཤེགས་སོ། །
en: And at that moment, right then, that very instant, the Blessed One disappeared from the Brahmā realms and returned to the pair of śāla trees in the country of the Mallas.

source: དེ་ནས་བཅོམ་ལྡན་འདས་འདི་སྙམ་དུ་དགོངས་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ང་ནི་དོ་མོད་ནམ་གྱི་ཐུན་ཐ་མ་ལ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་ཏེ།
en: The Blessed One then thought, “This night, I, the thus-gone, worthy, completely perfect Buddha, will pass into parinirvāṇa during the last watch of the night.

source: སེམས་ཅན་རྣམས་ལ་བསྟན་པར་བྱ་བའི་ཐ་མ་ནི་འདི་ཡིན་གྱིས། བདག་གིས་དེ་བཞིན་གཤེགས་པའི་ཆོ་འཕྲུལ་ཆེན་པོ་སེམས་ཅན་རྣམས་མཆོག་ཏུ་དགའ་བར་བྱེད་པ།
en: Since this will be my last teaching, I will bring joy to beings with a great miracle that only the Thus-Gone One can manifest.

source: བདེ་བ་སྐྱེད་པར་བྱེད་པ། སྡུག་བསྔལ་ཉེ་བར་ཞི་བར་བྱེད་པ། སེམས་ཅན་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པའི་བདག་ཉིད་ཆེན་པོ་ལ་ཐོགས་པ་མེད་པར་འཇུག་པར་འགྱུར་བ།
en: It will make them happy, it will quell their suffering, so that all beings will merge unobstructedly with the nature of the Thus-Gone One.

source: སངས་རྒྱས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་དང་ལྡན་པ་དག་ཀུན་ཏུ་བསྟན་པར་བྱའོ། །སྙམ་དུ་དགོངས་སོ། །
en: I will show them how the Buddha passes into parinirvāṇa.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྐུའི་གློ་གཡས་པ་བཏེགས་ཏེ།
en: The Blessed One then lay on his right side.

source: སེང་གེ་བཞིན་དུ་བག་ཚ་བ་མི་མངའ་བར་ཕྱོགས་བཅུའི་སྐྱེ་དགུ་དེ་དག་ལ་གླང་པོ་ཆེའི་ལྟ་སྟངས་ཀྱིས་གཟིགས་ནས་ཞབས་གཡས་པའི་མཐེ་བོས་ས་ཆེན་པོ་ལ་བསྣུན་ཏོ། །
en: With the fearlessness of a lion and the gaze of an elephant, he looked out over all beings in the ten directions and pierced the earth with the big toe of his right foot.

source: བསྣུན་པ་དང་དེ་ལས་སྒྲ་སྐད་ཆེན་པོ་བྱུང་ཞིང་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་གཡོས་ཏེ།
en: At this strike, the earth let out a huge roar and shook in six different ways.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་དག་འོད་བསམ་གྱིས་མི་ཁྱབ་ཅིང་ཐོགས་པ་མེད་པས་སྣང་བར་ཡང་གྱུར་ཏོ། །
en: Inconceivable quantities of light filled worlds in the ten directions, illuminating them all without obstruction.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྐུ་ལས་འོད་ཟེར་འདི་ལྟ་བུ་དག་རབ་ཏུ་བཀྱེ་སྟེ། འོད་ཟེར་རབ་ཏུ་བཀྱེ་བ་དེས་སྤུའི་ཁུང་བུ་རེ་རེ་ནས་ཀྱང་འོད་ཟེར་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་བྱུང་ངོ་། །
en: Rays of light flooded from the Blessed One’s body, and rays as numerous as the grains of sand in the river Gaṅgā poured from every pore.

source: འོད་ཟེར་དེ་དག་རེ་རེ་ལས་ཀྱང་འོད་ཟེར་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་བྱུང་ངོ་། །འོད་ཟེར་རེ་རེས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་སྣང་བར་བྱས་ཏེ།
en: Each of those rays of light in turn emitted further rays of light as numerous as the grains of sand in the river Gaṅgā, and each of those rays of light in turn illuminated as many buddha fields as there are grains of sand in the river Gaṅgā.

source: འོད་ཟེར་གཅིག་དང་འོད་ཟེར་གཉིས་པ་ལྷན་ཅིག་མི་འགྲོགས་པར་འགྲོ་ཞིང་ཡང་དང་ཡང་དུ་སྤུའི་ཁུང་བུ་སོ་སོ་ནས་འོད་ཟེར་རབ་ཏུ་བཀྱེ་བས་འཇིག་རྟེན་གྱི་ཁམས་དེ་སྙེད་སྣང་བར་མཛད་དོ། །
en: The rays of light did not merge with one another but shone continuously from every pore, completely illuminating every world system.

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་འདི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་འདུ་མཛད་དེ། རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་ཇི་ལྟ་བུ་མངོན་པར་འདུ་མཛད་པས་སངས་རྒྱས་ཀྱི་མཐུ་དང་། སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་སྤྱན་དང་ལྡན་པར་གྱུར་ཅིང་སངས་རྒྱས་ཀྱི་སྤྱན་གྱི་བྱེ་བྲག་ཀྱང་རྟོགས་པར་གྱུར་ཏེ།
en: With the Blessed One’s manifestation of such a miraculous display, all those beings became endowed with the eye of awakening and realized the detailed vision of awakening by means of the Buddha’s power and blessings.

source: དེ་དག་ཐམས་ཅད་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་ཇི་སྙེད་བཅོམ་ལྡན་འདས་ཀྱི་འོད་ཀྱིས་གསལ་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་མཐོང་བར་གྱུར་ཏོ། །
en: Everyone could clearly see all the buddha fields illuminated by the light of the Blessed One.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་ཁྱེད་ཀྱིས་ཤར་ཕྱོགས་ལོགས་ན་ཁོ་ར་ཁོར་ཡུག་གི་ཁྱོན་དུ་དཔག་ཚད་འབུམ་ཡོད་པའི་གྲོང་ཁྱེར་དེ་ལྟར་ཆེ་བ། དེ་ལྟར་ཡངས་པ། དེ་ལྟར་མ་ཐོ་བ། དེ་ལྟར་རྒྱ་ཆེ་བ་ཞིག་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་བརྒྱ་སྟོང་དག་གིས་ཡོངས་སུ་གང་བ་མཐོང་ངམ།
en: The Blessed One then said to the monks, “Monks, do you see, in the east, a huge, wide, high, and expansive city covering an area of one hundred thousand leagues, completely filled with hundreds of thousands of tiny particles?”

source: གསོལ་པ།
en: “Yes, Blessed One,” replied the monks.

source: བཅོམ་ལྡན་འདས་དེ་དེ་ལྟ་ལགས་སོ། །བཀའ་སྩལ་པ། དགེ་སློང་དག་འདི་ཇི་སྙམ་དུ་སེམས།
en: The Blessed One continued, “And what do you think, monks?

source: རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་དེ་དག་མང་བ་ཡིན་སྙམ་འམ། གསོལ་པ།
en: Do you think those tiny particles are numerous?”

source: བཅོམ་ལྡན་འདས་དེ་དེ་ལྟ་ལགས་སོ། །
en: “Yes, Blessed One,” replied the monks.

source: བཀའ་སྩལ་པ། གང་གིས་ཟག་མེད་ལེན་མེད་ཅིང་། །འགག་མེད་ཟག་པ་མེད་པ་ཡི། །ཆོས་དེ་རབ་ཏུ་ཤེས་པ་དག །དེ་དག་ངན་འགྲོར་འགྲོ་མི་འགྱུར། །
en: He continued: “Those who clearly understand the Dharma, As inexhaustible, free of grasping, Unceasing, and uncorrupted, Will not experience bad rebirth.”

source: དེ་ནས་སྲོག་ཆགས་བྱེ་བ་ཕྲག་སུམ་ཅུ་རྩ་གསུམ་གྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ཐོབ་པར་གྱུར་ཏེ། ཆོས་ཐོབ་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །ཟད་པ་མ་མཆིས་ལེན་མ་མཆིས། །མི་འགག་ཟག་པ་མ་མཆིས་པ། །འཕགས་པའི་ཆོས་འདི་འཚལ་གྱུར་པས། །བདག་ཅག་བསིལ་གྱུར་མྱ་ངན་འདས། །མཁྱེན་ནས་ཇི་བཞིན་ཉིད་བརྙེས་ཤིང་། །སེམས་ཅན་རྣམས་ཀྱི་དབང་པོ་མཁྱེན། །རྒྱུ་དང་རྐྱེན་རྣམས་སྟོན་མཛད་ཅིང་། །སེམས་ཅན་རྣམས་ལ་ཐུགས་བརྩེ་བ། །ཟུག་རྔུ་འབྱིན་ཅིང་གསོས་མཛད་ལ། །སྨན་སྩོལ་མཛད་ཅིང་ཐམས་ཅད་མཁྱེན། །མྱ་ངན་འདའ་བ་སྟོན་མཛད་པའི། །རྫོགས་སངས་རྒྱས་ཀྱིས་བདག་ཅག་བཏུལ། །མིག་དང་སྒྲོན་མར་གྱུར་པ་འདི། །ཤིན་ཏུ་མྱུར་བར་འདས་གྱུར་ན། །སུ་ཞིག་སྲོག་ཆགས་བྱེ་བ་རྣམས། །ཡང་སོས་གནོད་ལས་ཐར་མཛད་འགྱུར། །ཟུག་རྔུ་འབྱིན་མཛད་སྨན་པ་ཆེ། །འབྱུང་པོ་ཀུན་གྱི་གསོས་མཛད་པ། །དེ་ཡིས་སེམས་ཅན་གང་གསོས་པ། །དེ་དག་ངན་འགྲོར་མཆི་མི་འགྱུར། །དེ་ནས་བཅོམ་ལྡན་འདས་དེའི་ཚེ་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ཐིག་ནག་གི་གནས་ཀྱི་མཐར་བཞུགས་ཏེ་འོད་རྒྱ་ཆེན་པོ་རབ་ཏུ་བཀྱེའོ། །དེས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོའི་གནས་དེ་སྣང་བར་གྱུར་ནས་སྲོག་ཆགས་སྟོང་ཕྲག་མང་པོ་དག་དེ་ནས་བཏོན་ཏེ་མཐོ་རིས་ལ་རབ་ཏུ་བཀོད་དོ། །དེ་བཞིན་དུ་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་བསྡུས་གཞོམ་དང་། ངུ་འབོད་དང་། ངུ་འབོད་ཆེན་པོ་དང་། ཚ་བ་དང་། རབ་ཏུ་ཚ་བ་དག་ནས་ཀྱང་སྲོག་ཆགས་སྟོང་ཕྲག་མང་པོ་དག་བཏོན་ཏེ་མཐོ་རིས་དང་མྱ་ངན་ལས་འདའ་བ་ལ་རབ་ཏུ་བཀོད་དོ། །
en: Upon hearing this Dharma teaching, three hundred thirty million beings obtained the level of nonreturning.

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་བརྒྱད་ཀྱི་གནས་རྣམས་སུ་འོད་ཟེར་གསེར་གྱི་ཁ་དོག་ལྟ་བུར་ཤིན་ཏུ་འཇམ་པ། དགའ་བར་གྱུར་པ། ཡིད་དུ་འོང་བ། སྡུག་བསྔལ་ཉེ་བར་ཞི་བར་བྱེད་པ། མིག་དགའ་བར་བྱེད་པ། སྙིང་དང་མིག་རབ་ཏུ་སིམ་པ་སྐྱེད་པ།
en: The Blessed One then illuminated the beings dwelling in the eight great hells with a very gentle, delightful, and pleasant golden-colored light, born from love and compassion, that pacified their suffering, pleased their eyes, enchanted their hearts and eyes, soothed them, and filled their bodies with ease.

source: བསིལ་བ། བྱམས་པ་དང་། སྙིང་རྗེ་ལས་ངེས་པར་བྱུང་བ། ལུས་བདེ་བ་སྐྱེད་པར་བྱེད་པས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོའི་གནས་དེ་དག་གསལ་བར་མཛད་ཅིང་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་དེ་དག་གི་མེའི་གདུང་བ་སྐྱེས་པའི་གདུང་བ་ཡང་ཡོངས་སུ་ཞི་བར་མཛད་ནས། སེམས་ཅན་དེ་དག་ལ་བདེ་བ་ཉེ་བར་བསྒྲུབ་པའི་ཕྱིར་སྤུའི་ཁུང་བུ་ཐམས་ཅད་ནས་མཐར་གྱིས་འོད་དེ་དག་རབ་ཏུ་བཀྱེའོ། །
en: The waves of light rays that radiated from the pores of his skin thoroughly quelled the burning torments of those in the great hells and instilled happiness in them.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འོད་ཀྱིས་སེམས་ཅན་དེ་དག་གི་ལུས་མངོན་པར་བརླན་པར་མཛད་ཅིང་ལུས་དང་སེམས་འཇམ་ཞིང་ལས་སུ་རུང་བ་བསྐྱེད་ནས་ཡོན་ཏན་འབུམ་ཕྲག་དུ་མ་དང་ལྡན་པའི་གསུང་གིས་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ། ང་ནི་འཇིག་རྟེན་བདེ་སྩོལ་ཅིང་། །ང་ནི་སྡུག་བསྔལ་ཐར་མཛད་པ། །
en: The Blessed One drenched the bodies of those beings with this light, soothing them physically and mentally, making them fit again, and then, with speech endowed with many hundreds of thousands of good qualities, he spoke these verses: “I bring happiness to the world; I put an end to suffering.

source: ང་ནི་ལུས་ངལ་གྱུར་པ་རྣམས། །རབ་ཏུ་ཞི་བ་སྟོན་མཛད་པའོ། །
en: I have shown complete peace To those who are physically weary.

source: ངས་བཤད་ཞི་བ་བདེ་བ་དང་། །ཤིན་ཏུ་བལྟ་དཀའི་ཆོས་གང་ཡིན། །གང་དག་ཆོས་དེ་རབ་ཤེས་པ། །དེ་དག་ངན་འགྲོར་འགྲོ་མི་འགྱུར། །
en: “What I have taught is the Dharma that is hard to find, The Dharma of peace and happiness; Those who understand it Will not experience bad rebirth.

source: གང་དག་སངས་རྒྱས་སྐྱབས་སོང་བའི། །མི་རྣམས་དེ་དག་རྙེད་པ་ཡོད། །དེ་དག་བསྐལ་པ་སྟོང་རྣམས་སུ། །ཕྱིན་ཆད་སྡུག་བསྔལ་བསྟེན་མི་འགྱུར། །བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་དེ་དག་བཀའ་སྩལ་མ་ཐག་ཏུ་དེ་ནས་སྐད་ཅིག་དེ་དང་།
en: “Those who have found it, Who have taken refuge in the Buddha, Will henceforth not endure suffering For thousands of eons.”

source: ཐང་ཅིག་དེ་དང་། ཡུད་ཙམ་དེ་ལ་དེ་ནས་དགེ་སློང་རབ་ཏུ་མང་པོ་དག་དང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཚད་མེད་པ་དག་ཀྱང་། སྐད་ཅིག་དང་། ཐང་ཅིག་དང་། ཡུད་ཙམ་དེ་ལ་སེང་གེའི་གཟིམས་ཁྲི་དག་ལ་གློ་གཡས་པས་ཕབ་སྟེ་གཟིམས་པར་གྱུར་ནས་དེ་དག་ཀྱང་སླར་བཞེངས་ཏེ་ཆོ་འཕྲུལ་དེ་ལྟ་བུ་དག་ཀུན་ཏུ་སྟོན་པར་མཛད་དོ། །
en: As soon as the Blessed One had spoken these verses, at that moment, right then, at that very instant, a great number of monks and an immeasurable number of blessed buddhas simultaneously, right then, at that very instant, having lain down on their right sides upon lion couches, also got up again, and all of them also displayed miracles like these.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་འཁོར་བཞི་པོ་དེ་དག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The four communities then asked the Blessed One, “Blessed One, why did all those blessed buddhas display such miracles just now?

source: བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་འདི་ལྟ་སྟེ་དཔེར་བགྱི་ན་ད་ལྟར་བཅོམ་ལྡན་འདས་བཞིན་དུ། སྐད་ཅིག་འདི་དང་། ཐང་ཅིག་འདི་དང་། ཡུད་ཙམ་འདི་ལ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ལ་མངོན་པར་ཕྱོགས་ཤིང་ཆོ་འཕྲུལ་དེ་ལྟ་བུ་དག་ཀུན་ཏུ་སྟོན་པར་མཛད་ལགས།
en: Why, just like the Blessed One, did they all display such miracles at the very moment, the very instant of passing into parinirvāṇa?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་དེ་དེ་བཞིན་ཏེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ཀྱང་དེང་སྲིད་པ་ཐ་མ་སྤངས་ཏེ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ། །
en: The Blessed One replied, “It is so, monks: all those blessed buddhas leaving their final existence today will pass into parinirvāṇa.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་མཚན་འཐུན་པ་ཤ་སྟག་སྟེ།
en: All those thus-gone ones are none other than he who bears the name Śākyamuni.

source: ཐམས་ཅད་ཀྱང་གྱད་རྣམས་དང་ཉེ་བ་ན་ཡོད་པ་ཤིང་སཱ་ལ་ཟུང་གི་བར་ཤ་སྟག་ཏུ་སེང་གེའི་གཟིམས་ཁྲི་ལ་སྐུའི་གློ་གཡས་པས་ཕབ་སྟེ་བཞུགས་སོ། །
en: All of them have lain down on their right sides upon a lion couch between two śāla trees within the country of the Mallas.

source: དེ་དག་ཐམས་ཅད་ཀྱང་དོ་མོད་ནམ་གྱི་ཐུན་ཐ་མ་ལ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ། །
en: All of them will pass into parinirvāṇa today, during the last watch of the night.”
